# =============================================================================
# BREWFILE - Package Dependencies for Dotfiles
# =============================================================================
# Usage: brew bundle install
# =============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# =============================================================================
# CORE DEVELOPMENT TOOLS
# =============================================================================

# Shell & Terminal
brew "zsh"
brew "tmux"
brew "starship"           # Alternative prompt (if not using p10k)

# Version Control
brew "git"
brew "lazygit"
brew "gh"                 # GitHub CLI

# Text Editors
brew "neovim"
brew "vim"

# Search & Navigation
brew "ripgrep"            # Fast grep alternative
brew "fd"                 # Fast find alternative  
brew "fzf"                # Fuzzy finder
brew "tree"               # Directory tree
brew "exa"                # Better ls
brew "bat"                # Better cat
brew "tldr"               # Simplified man pages

# File Management
brew "stow"               # Symlink manager
brew "rsync"
brew "wget"
brew "curl"

# System Monitoring
brew "htop"
brew "btop"               # Modern htop
brew "bottom"             # Another system monitor

# Development Utilities
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "watch"
brew "entr"               # File watcher

# =============================================================================
# LANGUAGE RUNTIMES & PACKAGE MANAGERS
# =============================================================================

# Node.js ecosystem
brew "node"
brew "pnpm"
brew "yarn"

# Python
brew "python@3.11"
brew "python@3.12"
brew "pyenv"
brew "pipenv"
brew "poetry"

# Ruby
brew "ruby"
brew "rbenv"

# Other languages
brew "go"
brew "rust"
brew "lua"
brew "deno"

# =============================================================================
# PRODUCTIVITY & WINDOW MANAGEMENT
# =============================================================================

# Window Management
brew "nikitabobko/tap/aerospace"
brew "FelixKratz/formulae/sketchybar"

# =============================================================================
# APPLICATIONS
# =============================================================================

# Productivity
cask "raycast"
cask "alfred"             # Alternative to Raycast

# Development
cask "cursor"
cask "visual-studio-code"
cask "iterm2"
cask "alacritty"
cask "kitty"
cask "wezterm"

# Browsers
cask "arc"
cask "google-chrome"
cask "firefox"

# Design & Media
cask "figma"
cask "imageoptim"

# Communication
cask "discord"
cask "slack"
cask "zoom"

# Utilities
cask "the-unarchiver"
cask "keka"               # Archive utility
cask "cleanmymac"
cask "appcleaner"

# Development Tools
cask "docker"
cask "postman"
cask "tableplus"          # Database GUI
cask "proxyman"           # HTTP debugging

# =============================================================================
# FONTS
# =============================================================================

# Coding Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-cascadia-code"

# =============================================================================
# OPTIONAL/SPECIALIZED TOOLS
# =============================================================================

# Database
brew "postgresql@15"
brew "redis"
brew "sqlite"

# Cloud & DevOps
brew "awscli"
brew "terraform"
brew "kubernetes-cli"
brew "helm"
brew "docker-compose"

# Security
brew "gnupg"
brew "pass"

# Media
brew "ffmpeg"
brew "imagemagick"

# Network
brew "nmap"
brew "httpie" 